---
title: PropertySetElement
classe: Autodesk.Revit.DB.PropertySetElement
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# PropertySetElement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `PropertySetElement Create(Document, ThermalAsset)` | `PropertySetElement.Create(document, thermalAsset)` | PropertySetElement |
| `PropertySetElement Create(Document, StructuralAsset)` | `PropertySetElement.Create(document, structuralAsset)` | PropertySetElement |
| `PropertySetElement Duplicate(Document, String)` | `propertySetElement.Duplicate(document, name)` | PropertySetElement |
| `StructuralAsset GetStructuralAsset()` | `propertySetElement.GetStructuralAsset()` | StructuralAsset |
| `ThermalAsset GetThermalAsset()` | `propertySetElement.GetThermalAsset()` | ThermalAsset |
| `Void SetStructuralAsset(StructuralAsset)` | `propertySetElement.SetStructuralAsset(structuralAsset)` | Void |
| `Void SetThermalAsset(ThermalAsset)` | `propertySetElement.SetThermalAsset(thermalAsset)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```